Revit 2024 API
FabricReinSpanSymbol Class
 Represents an instance of a Structural Fabric Reinforcement Symbol in Autodesk Revit.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class FabricReinSpanSymbol : IndependentTag
Visual Basic
Public Class FabricReinSpanSymbol _
	Inherits IndependentTag
Visual C++
public ref class FabricReinSpanSymbol : public IndependentTag
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.IndependentTag
 Autodesk.Revit.DB.Structure.FabricReinSpanSymbol
See Also
FabricReinSpanSymbol Members
Autodesk.Revit.DB.Structure Namespace